# Data Science Pandas - Joins, Time Series & Rolling Statistics, SQL

## Tasks Today:

1) <b>Pandas</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; a) Joins <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - merge() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Breaking Down the Inner Join <br>
 &nbsp;&nbsp;&nbsp;&nbsp; b) Outer Joins <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Use Case Example <br>
 &nbsp;&nbsp;&nbsp;&nbsp; c) Rolling Statistics and Time Series w/Pandas <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - read_csv() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - shift() <br>
 2) <b> SQL </b> <br>
      - Adding DataFrame to Database Table
      - Reading SQL Query Result into DataFrame

In [ ]:
import pandas as pd
import numpy as np

### Joins <br>
<p>Very often you will have to combine data from several different sources to obtain the actual dataset you need for your exploration or modeling. Pandas draws heavily on SQL in its API design for joins, and if you are familiar with SQL joins, then Pandas will come naturally. Imagine you have two tables, one with customer name and gender, and the other with their purchases:</p>

In [5]:
# Generate some fake data
city_data ={
    1: 'Chicago',
    2: 'Houston',
    3: 'New York',
    4: 'San Franciso',
    5: 'Washington D.C.'
}
ages = np.random.randint(18,65,100)
city = [city_data[num] for num in np.random.randint(1,6,100)]
customer_id= np.arange(1000,1100)

<p>Let's assume we have a dataset containing the customer ID's cities, and ages for a set of customers. Suppose further, that we have a second table, containing some customer ID's, and a feedback survey rating from those customers. Suppose finally, that you as an analyst are asked the following question: What city tends to give the best feedback for our product? We'll need a join operation to get the answer.</p>

In [6]:
customer_demographics = pd.DataFrame.from_dict({
    'ages' : ages,
    'city' : city,
    'customer_id' : customer_id
})

customer_demographics

    ages             city  customer_id
0     63         New York         1000
1     30         New York         1001
2     39         New York         1002
3     23         New York         1003
4     46          Houston         1004
..   ...              ...          ...
95    47  Washington D.C.         1095
96    44     San Franciso         1096
97    57         New York         1097
98    25  Washington D.C.         1098
99    26          Chicago         1099

[100 rows x 3 columns]

In [25]:
# Generate some other fake data
customer_id = np.random.randint(1000,1200,100)
customer_rating = np.random.randint(1,11,100)

surveys= pd.DataFrame.from_dict({
    'customer_id' : customer_id,
    'customer_rating' : customer_rating
})

surveys.head(20)

    customer_id  customer_rating
0          1013                9
1          1043                2
2          1004                9
3          1069                5
4          1079                6
5          1135               10
6          1053                3
7          1152                3
8          1165                8
9          1188                1
10         1058                6
11         1144                6
12         1099                3
13         1090                2
14         1094                5
15         1187                7
16         1089                3
17         1174               10
18         1020                5
19         1120                6

##### merge()

<p>We can zip the two dataframes up with an inner join, using the Pandas API as follows:</p>

In [12]:
demo_ratings = customer_demographics.merge(surveys,on = 'customer_id', how ='inner')
demo_ratings.head(20)

    ages             city  customer_id  customer_rating
0     63          Chicago         1002                5
1     63          Chicago         1002                3
2     44  Washington D.C.         1008                8
3     55         New York         1010                3
4     52          Houston         1011                2
5     48          Chicago         1014                5
6     19          Chicago         1017                8
7     26  Washington D.C.         1019                4
8     26  Washington D.C.         1019                3
9     29          Chicago         1020                9
10    59  Washington D.C.         1021                4
11    59          Chicago         1023                6
12    59          Chicago         1023               10
13    42          Chicago         1025                8
14    21         New York         1026                9
15    23  Washington D.C.         1028                9
16    25          Houston         1029                5
17    24  Washington D.C.         1030               10
18    29     San Franciso         1031                6
19    23          Houston         1032                2

In [19]:
demo_ratings_dropped = demo_ratings.drop_duplicates(subset ='customer_id').reset_index(drop = True)
demo_ratings_dropped

    ages             city  customer_id  customer_rating
0     63          Chicago         1002                5
1     44  Washington D.C.         1008                8
2     55         New York         1010                3
3     52          Houston         1011                2
4     48          Chicago         1014                5
5     19          Chicago         1017                8
6     26  Washington D.C.         1019                4
7     29          Chicago         1020                9
8     59  Washington D.C.         1021                4
9     59          Chicago         1023                6
10    42          Chicago         1025                8
11    21         New York         1026                9
12    23  Washington D.C.         1028                9
13    25          Houston         1029                5
14    24  Washington D.C.         1030               10
15    29     San Franciso         1031                6
16    23          Houston         1032                2
17    35          Chicago         1034                5
18    48         New York         1035                3
19    28          Houston         1037                7
20    64          Chicago         1042                3
21    42          Chicago         1044                2
22    18         New York         1045                7
23    46  Washington D.C.         1046                5
24    46         New York         1047                3
25    25     San Franciso         1049                8
26    29         New York         1050                1
27    34  Washington D.C.         1052                5
28    38          Houston         1056                1
29    47          Houston         1061               10
30    63  Washington D.C.         1064                2
31    36          Chicago         1069                9
32    19         New York         1071                8
33    51          Chicago         1076                1
34    23          Chicago         1078                7
35    59          Houston         1079                9
36    41         New York         1080               10
37    20          Houston         1083               10
38    22     San Franciso         1084                2
39    64  Washington D.C.         1085                1
40    56     San Franciso         1088                7
41    53         New York         1090                1
42    63          Houston         1091                5
43    46     San Franciso         1097               10

**.join() method**

In [26]:
# join() is used to combine two DataFrames on the index but not on
# columns whereas merge() is primarily used to specify the columns
# you wanted to join on, this also supports joining on indexes and combination of index and columns

demo_surveys_join = customer_demographics.join(other = surveys.set_index('customer_id'),on ='customer_id', how = 'inner')
demo_surveys_join

demo_surveys_join_nodups = demo_surveys_join.drop_duplicates(subset ='customer_id').reset_index(drop =True)
demo_surveys_join_nodups

    ages             city  customer_id  customer_rating
0     63          Chicago         1002                5
1     44  Washington D.C.         1008                8
2     55         New York         1010                3
3     52          Houston         1011                2
4     48          Chicago         1014                5
5     19          Chicago         1017                8
6     26  Washington D.C.         1019                4
7     29          Chicago         1020                9
8     59  Washington D.C.         1021                4
9     59          Chicago         1023                6
10    42          Chicago         1025                8
11    21         New York         1026                9
12    23  Washington D.C.         1028                9
13    25          Houston         1029                5
14    24  Washington D.C.         1030               10
15    29     San Franciso         1031                6
16    23          Houston         1032                2
17    35          Chicago         1034                5
18    48         New York         1035                3
19    28          Houston         1037                7
20    64          Chicago         1042                3
21    42          Chicago         1044                2
22    18         New York         1045                7
23    46  Washington D.C.         1046                5
24    46         New York         1047                3
25    25     San Franciso         1049                8
26    29         New York         1050                1
27    34  Washington D.C.         1052                5
28    38          Houston         1056                1
29    47          Houston         1061               10
30    63  Washington D.C.         1064                2
31    36          Chicago         1069                9
32    19         New York         1071                8
33    51          Chicago         1076                1
34    23          Chicago         1078                7
35    59          Houston         1079                9
36    41         New York         1080               10
37    20          Houston         1083               10
38    22     San Franciso         1084                2
39    64  Washington D.C.         1085                1
40    56     San Franciso         1088                7
41    53         New York         1090                1
42    63          Houston         1091                5
43    46     San Franciso         1097               10

<p>Now it's a simple groupby operation to reveal the answer:</p>

In [34]:
city_ages_ratings = demo_ratings_dropped.groupby('city', as_index = False). mean().round(decimals = 2)[['city', 'ages', 'customer_rating']]
city_ages_ratings

              city   ages  customer_rating
0          Chicago  42.58             5.67
1          Houston  39.44             5.67
2         New York  36.67             5.00
3     San Franciso  35.60             6.60
4  Washington D.C.  42.56             5.33

But what if we didn't drop the customer_id duplicates...would we get the same city result??

In [ ]:
city_ages_ratings_dups = demo_ratings.groupby('city', as_index =False).mean().round(decimals =2)[['city','ages','customer_rating']]
city_ages_ratings_dups

What would be the total mean for the US customers?

In [45]:
city_ratings_mean = demo_ratings_dropped.groupby('city').mean()
city_ratings_mean.loc['Houston']

ages                 39.444444
customer_id        1053.222222
customer_rating       5.666667
Name: Houston, dtype: float64

##### Breaking Down the Inner Join <br>
<p>Let's take a closer look at the actual mechanics here however. There is some subtlety and nuance that is best understood by thinking of an inner join as two steps: a cartesian product, and then a filter. Observe the result of the following inner join:</p>

In [8]:
d = { 
    'A': [1,2,3,4,2],
    'B': ['a','b','c','d','x'] 
}
df1 = pd.DataFrame.from_dict(d)
df1

   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  2  x

In [10]:
d2 = { 
    'A': [1,2,6,2,2],
    'C': ['e','f','g','h','y'] 
}
df2 =pd.DataFrame.from_dict(d2)
df2

   A  C
0  1  e
1  2  f
2  6  g
3  2  h
4  2  y

In [11]:
df1.merge(df2, on= 'A', how = 'inner')

   A  B  C
0  1  a  e
1  2  b  f
2  2  b  h
3  2  b  y
4  2  x  f
5  2  x  h
6  2  x  y

<p>Somehow, we ended up with more rows in the result than either of the original tables! This is because we joined on a $\textit{non-unique index}$. The join starts by computing all the possible combinations of rows, and then filters them based on the condition. Because of the duplicates, multiple combinations of rows make it through!</p>

### Outer Joins <br>
<p>An $\textit{outer join}$ produces all of the rows from the left table, and joins whatever rows it can to the right table, filling anywhere it cant with NaN's or None values. Below is a brief example, and then we will discuss a possible use case for this type of join.</p>

In [13]:
df3 = pd.DataFrame.from_dict({
    'A': [1,2,3],
    'B': ['a','b','c']
})

df4 = pd.DataFrame.from_dict({
    'A':[1],
    'C':['d']
})

In [14]:
df3

   A  B
0  1  a
1  2  b
2  3  c

In [15]:
df4

   A  C
0  1  d

In [16]:
df3.merge(df4, on= 'A', how = 'outer')

   A  B    C
0  1  a    d
1  2  b  NaN
2  3  c  NaN

In [18]:
# LEFT JOIN MERGE
df3.merge(df4, on= 'A', how = 'left')

   A  B    C
0  1  a    d
1  2  b  NaN
2  3  c  NaN

In [19]:
# RIGHT JOIN MERGE
df3.merge(df4, on= 'A', how = 'right')

   A  B  C
0  1  a  d

##### Use Case Example

<p>As an example use case, let's imagine we have again the demographics and survey response tables from above:</p>

In [23]:
customer_demographics.head()

    ages             city  customer_id
0     63         New York         1000
1     30         New York         1001
2     39         New York         1002
3     23         New York         1003
4     46          Houston         1004
..   ...              ...          ...
95    47  Washington D.C.         1095
96    44     San Franciso         1096
97    57         New York         1097
98    25  Washington D.C.         1098
99    26          Chicago         1099

[100 rows x 3 columns]

In [26]:
surveys.head()

   customer_id  customer_rating
0         1013                9
1         1043                2
2         1004                9
3         1069                5
4         1079                6

<p>Now, you are asked as an analyst to compare the demographics of survey responders to the demographics of all your customers combined.</p>

In [34]:
demo_ratings_outer = customer_demographics.merge(surveys, on ='customer_id',how = 'outer')
demo_ratings_outer['customer_rating'] = demo_ratings_outer['customer_rating'].fillna('N/A')
demo_ratings_outer.head(20)

    ages             city  customer_id customer_rating
0   63.0         New York         1000            10.0
1   30.0         New York         1001             2.0
2   39.0         New York         1002             8.0
3   23.0         New York         1003             8.0
4   46.0          Houston         1004             9.0
5   23.0          Chicago         1005             1.0
6   34.0  Washington D.C.         1006             N/A
7   59.0          Chicago         1007             7.0
8   59.0          Chicago         1007             8.0
9   52.0          Chicago         1008             N/A
10  18.0  Washington D.C.         1009             N/A
11  44.0  Washington D.C.         1010             2.0
12  62.0         New York         1011             N/A
13  45.0          Houston         1012             N/A
14  31.0          Chicago         1013             9.0
15  55.0          Chicago         1014             N/A
16  54.0          Chicago         1015             N/A
17  22.0     San Franciso         1016             N/A
18  57.0          Houston         1017             N/A
19  42.0          Houston         1018             N/A

In [52]:
# Count all survey responders against the total number of customers we have 
# (Specifically the customers that haven't taken the survey yet)
demo_size = demo_ratings_outer.groupby(['city', 'customer_rating']).size()
demo_size

# Producing similar result with .count()
demo_count = demo_ratings_outer.groupby(['city','customer_rating']).count()
demo_count

                                 ages  customer_id
city            customer_rating
Chicago         1.0                 1            1
                2.0                 2            2
                3.0                 1            1
                5.0                 1            1
                7.0                 1            1
                8.0                 1            1
                9.0                 2            2
                10.0                1            1
                N/A                16           16
Houston         2.0                 2            2
                3.0                 1            1
                4.0                 1            1
                5.0                 1            1
                6.0                 1            1
                8.0                 2            2
                9.0                 1            1
                10.0                4            4
                N/A                 7            7
New York        1.0                 1            1
                2.0                 4            4
                4.0                 1            1
                5.0                 1            1
                7.0                 3            3
                8.0                 2            2
                9.0                 1            1
                10.0                2            2
                N/A                12           12
San Franciso    3.0                 4            4
                5.0                 3            3
                6.0                 2            2
                7.0                 1            1
                8.0                 1            1
                9.0                 1            1
                N/A                 8            8
Washington D.C. 2.0                 1            1
                3.0                 1            1
                4.0                 1            1
                5.0                 1            1
                6.0                 2            2
                7.0                 1            1
                9.0                 2            2
                10.0                1            1
                N/A                11           11

In [53]:
# average age of people that answered the survey
survey_answered = demo_ratings_outer[demo_ratings_outer['customer_rating'] ! = 'N/A']

round(survey_answered['ages'].mean())

#demo_ratings_outer['customer_rating'] != 'N/A'

SyntaxError: invalid syntax (3204107475.py, line 2)

In [54]:
# find the average age of people that did not answer the survey
survey_non_answer = demo_ratings_outer[demo_ratings_outer[]]

KeyError: 'customer_ratings'

### Rolling Statistics and Time Series with Pandas

##### read_csv()

In [56]:
weather = pd.read_csv('chiweather.csv', sep = ';')

In [57]:
weather.head(10)

,Year,Month,Day,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd]
0,2017,11,25,0,0,51.85,0.0,17.31,327.13
1,2017,11,25,1,0,49.14,0.0,20.53,330.64
2,2017,11,25,2,0,46.42,0.0,21.41,327.80
3,2017,11,25,3,0,44.13,0.0,21.79,324.19
4,2017,11,25,4,0,42.22,0.0,21.03,321.91
5,2017,11,25,5,0,40.75,0.0,19.62,316.85
6,2017,11,25,6,0,40.71,0.0,19.17,318.31
7,2017,11,25,7,0,39.22,0.0,18.51,313.53
8,2017,11,25,8,0,39.49,0.0,18.73,310.16
9,2017,11,25,9,0,40.73,0.0,19.80,311.79

In [58]:
weather_update = weather.groupby(['Year','Month','Day']).mean().reset_index()
weather_update

,Year,Month,Day,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd]
0,2017,11,25,11.5,0.0,41.208750,0.000000,17.939583,325.761667
1,2017,11,26,11.5,0.0,38.298333,0.000000,11.435417,258.533750
2,2017,11,27,11.5,0.0,45.611250,0.000000,11.082500,188.377083
3,2017,11,28,11.5,0.0,48.497500,0.000000,17.418750,244.673333
4,2017,11,29,11.5,0.0,40.122917,0.020833,13.107083,167.510000
5,2017,11,30,11.5,0.0,43.618750,0.033333,14.343333,276.060000
6,2017,12,1,11.5,0.0,41.860417,0.000000,6.845000,223.459583
7,2017,12,2,11.5,0.0,45.324167,0.000000,8.934167,218.252500

In [65]:
print(weather_update.keys())

weather_update['last_temp'] = weather_update['Temperature  [2 m above gnd]'].shift(1)

Index(['Year', 'Month', 'Day', 'Hour', 'Minute',
       'Temperature  [2 m above gnd]', 'Total Precipitation  [sfc]',
       'Wind speed  [10 m above gnd]', 'Wind direction  [10 m above gnd]'],
      dtype='object')

##### shift() <br>
<p>Shift index by desired number of periods with an optional time freq</p>

In [66]:
# Print all keys for easier use
weather_update

,Year,Month,Day,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd],last_temp
0,2017,11,25,11.5,0.0,41.208750,0.000000,17.939583,325.761667,NaN
1,2017,11,26,11.5,0.0,38.298333,0.000000,11.435417,258.533750,41.208750
2,2017,11,27,11.5,0.0,45.611250,0.000000,11.082500,188.377083,38.298333
3,2017,11,28,11.5,0.0,48.497500,0.000000,17.418750,244.673333,45.611250
4,2017,11,29,11.5,0.0,40.122917,0.020833,13.107083,167.510000,48.497500
5,2017,11,30,11.5,0.0,43.618750,0.033333,14.343333,276.060000,40.122917
6,2017,12,1,11.5,0.0,41.860417,0.000000,6.845000,223.459583,43.618750
7,2017,12,2,11.5,0.0,45.324167,0.000000,8.934167,218.252500,41.860417

In [99]:
# create a new column that takes the difference in temperature from the previous day as an absolute value
weather_update['difference']= abs(weather_update['last_temp']- weather_update['Temperature  [2 m above gnd]'])
weather_update

,Year,Month,Day,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd],last_temp,differenece,difference
0,2017,11,25,11.5,0.0,41.208750,0.000000,17.939583,325.761667,0.000000,NaN,41.208750
1,2017,11,26,11.5,0.0,38.298333,0.000000,11.435417,258.533750,41.208750,2.910417,2.910417
2,2017,11,27,11.5,0.0,45.611250,0.000000,11.082500,188.377083,38.298333,7.312917,7.312917
3,2017,11,28,11.5,0.0,48.497500,0.000000,17.418750,244.673333,45.611250,2.886250,2.886250
4,2017,11,29,11.5,0.0,40.122917,0.020833,13.107083,167.510000,48.497500,8.374583,8.374583
5,2017,11,30,11.5,0.0,43.618750,0.033333,14.343333,276.060000,40.122917,3.495833,3.495833
6,2017,12,1,11.5,0.0,41.860417,0.000000,6.845000,223.459583,43.618750,1.758333,1.758333
7,2017,12,2,11.5,0.0,45.324167,0.000000,8.934167,218.252500,41.860417,3.463750,3.463750

In [93]:
#Pip intall for both psycopg2 and SQLAlchemy
import sys
!{sys.executable} -m pip install psycopg2 SQLALchemy

Requirement already satisfied: psycopg2 in c:\users\lhbal\anaconda3\lib\site-packages (2.9.9)
Requirement already satisfied: SQLALchemy in c:\users\lhbal\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\lhbal\anaconda3\lib\site-packages (from SQLALchemy) (2.0.1)

In [96]:
# databaselanguage(postgresql)://user:password@url:port/database_name
connection ='postgresql://iwptxeww:JXKdF3iHFOwgSTlAKMf4Oia_p2Iyv9t-@bubble.db.elephantsql.com/iwptxeww'

In [100]:
weather_update['last_temp'] = weather_update['last_temp'].fillna(float(0))
weather_update['difference'] = weather_update['difference'].fillna(float(0))
weather_update

,Year,Month,Day,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd],last_temp,differenece,difference
0,2017,11,25,11.5,0.0,41.208750,0.000000,17.939583,325.761667,0.000000,NaN,41.208750
1,2017,11,26,11.5,0.0,38.298333,0.000000,11.435417,258.533750,41.208750,2.910417,2.910417
2,2017,11,27,11.5,0.0,45.611250,0.000000,11.082500,188.377083,38.298333,7.312917,7.312917
3,2017,11,28,11.5,0.0,48.497500,0.000000,17.418750,244.673333,45.611250,2.886250,2.886250
4,2017,11,29,11.5,0.0,40.122917,0.020833,13.107083,167.510000,48.497500,8.374583,8.374583
5,2017,11,30,11.5,0.0,43.618750,0.033333,14.343333,276.060000,40.122917,3.495833,3.495833
6,2017,12,1,11.5,0.0,41.860417,0.000000,6.845000,223.459583,43.618750,1.758333,1.758333
7,2017,12,2,11.5,0.0,45.324167,0.000000,8.934167,218.252500,41.860417,3.463750,3.463750

In [106]:
# Writing a DataFrame to PostGreSQL database 
# from sqlalchemy.types import Integer, Text,String,DateTime,Float
from sqlalchemy.types import Integer, Text, String, DateTime,Float

weather_update.to_sql('chicago-weather', index=False, con = connection, if_exists = 'append',
                     schema = 'public', chunksize = 500, dtype = {
                         'year': String,
                         'month': String,
                         'day': String,
                         'minute': String,
                         'Tempertature  [2 m above gnd]': Float,
                         'Total Precipitation  [sfc]': Float,
                         'Wind speed  [10 m above gnd]': Float,
                         'last_temp': Float,
                         'difference': Float
                     })

8